In [1]:
%load_ext sql

In [2]:
%%sql sqlite:///books.db
CREATE TABLE BOOKS(book,author,price)

Done.

[]

In [3]:
%%sql
drop table BOOKS

 * sqlite:///books.db
Done.

[]

In [5]:
%%sql
CREATE TABLE BOOKS(book,author,price)

 * sqlite:///books.db
Done.

[]

In [6]:
%%sql
INSERT INTO BOOKS VALUES('The Celestine Prophecy','James Redfield',400);
INSERT INTO BOOKS VALUES('The Secret','Ronda Byrne',500);
INSERT INTO BOOKS VALUES('The Alchemist','Paulo Coelho',300);
INSERT INTO BOOKS VALUES('The Book Theif','Markus Zusak',350);

 * sqlite:///books.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
SELECT * FROM BOOKS

 * sqlite:///books.db
Done.

[('The Celestine Prophecy', 'James Redfield', 400),
 ('The Secret', 'Ronda Byrne', 500),
 ('The Alchemist', 'Paulo Coelho', 300),
 ('The Book Theif', 'Markus Zusak', 350)]

In [8]:
%%sql
select book from BOOKS where price < 500

 * sqlite:///books.db
Done.

[('The Celestine Prophecy',), ('The Alchemist',), ('The Book Theif',)]

In [9]:
%%sql
select book from BOOKS where price is not 350

 * sqlite:///books.db
Done.

[('The Celestine Prophecy',), ('The Secret',), ('The Alchemist',)]

In [10]:
%%sql
select author from BOOKS where book='The Secret' and price=500

 * sqlite:///books.db
Done.

[('Ronda Byrne',)]

In [11]:
%%sql
select author from BOOKS where book='The Secret' or price > 1000

 * sqlite:///books.db
Done.

[('Ronda Byrne',)]

In [12]:
%%sql
select * from BOOKS 
order by author ASC, price DESC

 * sqlite:///books.db
Done.

[('The Celestine Prophecy', 'James Redfield', 400),
 ('The Book Theif', 'Markus Zusak', 350),
 ('The Alchemist', 'Paulo Coelho', 300),
 ('The Secret', 'Ronda Byrne', 500)]

In [13]:
 #don't works with several cols so will
                                    #ignore the second condtion

In [14]:
%%sql
INSERT INTO BOOKS VALUES('Harry Potter','JK Rowling',555)

 * sqlite:///books.db
1 rows affected.

[]

In [15]:
%%sql
SELECT * FROM BOOKS

 * sqlite:///books.db
Done.

[('The Celestine Prophecy', 'James Redfield', 400),
 ('The Secret', 'Ronda Byrne', 500),
 ('The Alchemist', 'Paulo Coelho', 300),
 ('The Book Theif', 'Markus Zusak', 350),
 ('Harry Potter', 'JK Rowling', 555)]

In [16]:
%%sql 
INSERT INTO BOOKS VALUES('Elon Musk','AShlee Vance',Null)

 * sqlite:///books.db
1 rows affected.

[]

In [17]:
%%sql
select book,author,price from BOOKS where price is null

 * sqlite:///books.db
Done.

[('Elon Musk', 'AShlee Vance', None)]

In [18]:
%%sql
update BOOKS
set price = 599
where author = 'JK Rowling'

 * sqlite:///books.db
1 rows affected.

[]

In [19]:
%%sql 
delete from BOOKS 
where price = 599

 * sqlite:///books.db
1 rows affected.

[]

In [20]:
%%sql
select * from BOOKS limit 3

 * sqlite:///books.db
Done.

[('The Celestine Prophecy', 'James Redfield', 400),
 ('The Secret', 'Ronda Byrne', 500),
 ('The Alchemist', 'Paulo Coelho', 300)]

In [21]:
%%sql
select min(price) as min_price from BOOKS

 * sqlite:///books.db
Done.

[(300,)]

In [39]:
%%sql
select max(price) as max_price from BOOKS  --as is alais

 * sqlite:///books.db
Done.

[(500,)]

In [25]:
%%sql
select count(book) from BOOKS

 * sqlite:///books.db
Done.

[(5,)]

In [26]:
%%sql
update BOOKS
set price = 499
where book = 'Elon Musk'

 * sqlite:///books.db
1 rows affected.

[]

In [28]:
%%sql
select * from BOOKS

 * sqlite:///books.db
Done.

[('The Celestine Prophecy', 'James Redfield', 400),
 ('The Secret', 'Ronda Byrne', 500),
 ('The Alchemist', 'Paulo Coelho', 300),
 ('The Book Theif', 'Markus Zusak', 350),
 ('Elon Musk', 'AShlee Vance', 499)]

In [34]:
%%sql
select avg(price) from BOOKS;

 * sqlite:///books.db
Done.

[(409.8,)]

In [ ]:
# avg(), sum() #dont comment like this in db

In [36]:
%%sql
select book,author from BOOKS where author like'A%'   --finds patterns --this how u comment!

 * sqlite:///books.db
Done.

[('Elon Musk', 'AShlee Vance')]

In [37]:
%%sql
select book,author from BOOKS where book like'%k'

 * sqlite:///books.db
Done.

[('Elon Musk', 'AShlee Vance')]

In [38]:
%%sql
select book,author from BOOKS where author in ('AShlee Vance','James Redfield')

 * sqlite:///books.db
Done.

[('The Celestine Prophecy', 'James Redfield'), ('Elon Musk', 'AShlee Vance')]